def name_index names
  katakana = [
    [*'ア'..'オ']<<'ヴ',          # カタカナを行ごとに格納
    [*'カ'..'ゴ'],
    [*'サ'..'ゾ'],
    [*'タ'..'ド'],
    [*'ナ'..'ノ'],
    [*'ハ'..'ポ'],
    [*'マ'..'モ'],
    [*'ヤ'..'ヨ'],
    [*'ラ'..'ロ'],
    [*'ワ'..'ン']
  ]
  
  names.sort!                     # 名前の配列を辞書順にソート
  index=[]
  katakana.each do |gyou|         # 行ごとに名前の先頭がその行に含まれるかを判定
    names.each do |name|
      if gyou.include?(name[0])   # 含まれていた場合は、indexに追加
        if index.empty? || index[-1][0]!=gyou[0]    # 見出しが既に作られているかどうかを判定
          index << [gyou[0],[]]
        end
          index[-1][1]<<name
      end
    end
  end
  return index
end

names = ['キシモト', 'イトウ', 'ババ', 'カネダ', 'ワダ', 'ハマダ','ゴンダ','ドウモト','ヴィクトル']
p name_index names
# => [["ア", ["イトウ", "ヴィクトル"]], ["カ", ["カネダ", "キシモト", "ゴンダ"]], ["タ", ["ドウモト"]], ["ハ", ["ハマダ", "ババ"]], ["ワ", ["ワダ"]]]
